Revit 2027 API
StructuralConnectionHandler.GetInputPoints Method
 Returns a list of additional points defining certain connections.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<ConnectionInputPoint> GetInputPoints()
Public Function GetInputPoints As IList(Of ConnectionInputPoint)
public:
IList<ConnectionInputPoint^>^ GetInputPoints()
member GetInputPoints : unit -> IList<ConnectionInputPoint>
Return Value
IList<ConnectionInputPoint>
See Also
Reference
StructuralConnectionHandler Class
Autodesk.Revit.DB.Structure Namespace